[
  {
    "id": 5,
    "date": "2015/10/17",
    "title": "圆明园是谁烧的",
    "itemList": [
      {
        "text": "<p>土豪的儿子学习成绩不佳，一天课堂上老师问他圆明园是谁烧的，他说不是他烧的！老师当时就给他爸打电话说:你儿子最近上课越来越不像话了，我问圆明园是谁烧的，他竟然回答说不是他烧的... 回家后，被他爸一顿毒打，第二天他爸打电话给老师说:昨晚他已经承认圆明园是他烧的了！--- 老师，无论多少钱，我们家都赔！</p><p>第二天，历史老师怒不可遏，对校长说，我问他圆明圆谁烧的？他爹居然说不管多少钱他赔，真是气死我了。校长听了，语重心长地说，烧了就算了，你有所不知，他爹是政协委员，我市著名企业家，市长身边的红人，赞助过咱们学校，惹不起阿！对了，那个圆明圆是哪个单位的？烧了叫他爹再盖一个嘛。历史老师听了更生气，报告了教育局长。</p><p>教育局长说，事情已经发生了，急也没用，当务之急封锁消息，不能让记者知道是咱们学校的学生烧的，另外，那位同学先转学，叫他的家长配合做好亲友工作，消息不要外传，影响不要再扩大。</p><p>第三天，市长来到该校，怒斥校长：你个龟儿子，书没读过几天，大字不识几个，你姐央求我半天，好不容易我弄个校长给你当，你给我惹出那么大乱子。马上换届选举，你知道对我有多致命？我问你，火势控制了没有？消防的来了吗？",
        "image": ""
      }
    ]
  },
  {
    "id": 20,
    "date": "2015/10/17",
    "title": "等火车",
    "itemList": [
      {
        "text": "<p>一位夫人打电话给建筑师,说每当火车经过时,她的睡床就会摇动。</p><p>“这简直是无稽之谈”建筑师回答说,“我来看看。”</p><p>建筑师到达后,夫人建议他躺在床上,体会一下火车经过时的感觉。</p><p>建筑师刚上床躺下,夫人的丈夫就回来了。他见此情形,便厉声喝问：“你躺在我妻子的床上干什么？”</p><p>建筑师战战兢兢地回答：“我说是在等火车,你会相信吗？”",
        "image": ""
      }
    ]
  },
  {
    "id": 30,
    "date": "2015/10/18",
    "title": "中国村长与美国医生",
    "itemList": [
      {
        "text": "<p>某村长潜逃美国没事干，就开了家私人诊所，放了块牌子在外面，写着“病治好，付$300；治不好，退$1000。” 有个美国医生看到牌子，心想这是个挣钱的好机会啊，于是决定去一趟村长的诊所。 美国人：我失去味觉了，吃饭嘴里没味。 村长：护士，把22号盒的药拿来给病人嘴里滴三滴。 美国人：靠，这是汽油！ 村长：恭喜你，味觉恢复了，付$300吧。美国医生只好付了钱，很不爽地走了。</p><p>几天后又回到诊所，打算把损失的钱捞回来。 美国人：我失去了记忆，什么都记不住。 村长：护士，把22号盒的药拿来给病人嘴里滴三滴。美国人：靠，这不是上次治味觉的汽油吗！？ 村长：恭喜你，记忆恢复了，请付$300吧。 美国人只好又付了钱，愤怒地离开了。</p><p>几天后又回到诊所。 美国人：我的视力很差。 村长：抱歉！我没有什么药治这个病，这是退你的$1000… 美国人：可这只是$500！村长：恭喜你，视力恢复了，请付给我$300…… </p><p>美国人不甘心，过几月又去诊所，说耳朵听不见了。村长对护士嘀咕：这厮是想和咱们死磕到底，不如把22号药加些耗子药让他过去吧！美国人听后撒腿就跑。村人逮住他说：你的听力恢复了…没等村长说完，美国人扔下三百再不回来。</p><p>转年，那美国人又去诊所，心想这次无论你说什么我都装疯卖傻。谁知，村长见状大喜，赶紧给那美国人的妻子打电话：亲爱的，你老公都这逼样了，咱俩还偷偷摸摸地干啥？美国人听后夺过电话质问妻子。谁知电话根本就没挂通。 美国人发觉上当，认栽付钱。</p><p>这件事让这个美国人心堵，他吸取了以往所有的教训，让人推着去诊所。并嘱咐无论村长耍什么花招，大家都别上当。 村长见到美国人，似乎绝望地好久不出声，然后，进屋拿出一把手枪。美国人心想：跟我来这套，你还敢打死我吗？谁知村长走到美国人的轮椅前，把手枪握在美国人的手里，枪口对着自己的胸口就开了一枪。枪响过后，村长倒在血泊中。警察赶到时，美国人立马从轮椅上跳了起来，扔下手枪 说：不是我干的，是他把手枪放在我手上的。 这时，村长从地上爬起，掏出衣服内的血包说：小样！还想算计我！没有这点“思路”在中国能当村长!",
        "image": ""
      }
    ]
  },
  {
    "id": 40,
    "date": "2016/3/22",
    "title": "创新才有活路",
    "itemList": [
      {
        "text": "<p>一公司老总晚上酒驾，遇交警查车，弃车撒腿就跑，交警没追上。老总边跑边给老婆打电话，叫她马上报警，说家里的车被盗。</p><p>第二天，老总带着锦旗去交警队取车，握着交警同志的手，赞公安破案神速！<br/>交警：这都是我们应该做的，昨晚偷你车那小子跑太快，我们以为是酒驾，没想到是偷车的。 ",
        "image": ""
      },
      {
        "text": "老总再次酒驾。发现前方不远在查车，心想不能故技重演，于是下车锁门，坐在马路边抽烟。<br/>警察赶到：你喝酒了？<br/>老总：是呀！<br/>警察：喝了还开车？<br/>老总：我没开，司机开的；<br/>警察兜一圈不见司机：人呢？<br/>老总摇头：这混蛋跑了。<br/>见警察诧异，老总接着说：他一看到你们查车，气不打一处来：警察半夜三更不在家陪老婆孩子父母，又TM出来折腾了。我一听就狠训他，他不服，我趁着酒劲打了他一巴掌，没想到这混蛋把车一扔跑了，你说气人不气人！<br/>警察激动万分：这小子该揍，谢谢哥理解！没事哥，你上车，我送你回家。</p><p>老总坐在副驾，望着交警默默感悟：这年头不创新只有死路一条！ ",
        "image": ""
      }
    ]
  },
  {
    "id": 50,
    "date": "2015/10/21",
    "title": "傻子遇见收废品的",
    "itemList": [
      {
        "text": "傻子遇见个收废品的，小声的问他：收铁不？<br/>收废品的四处张望了下说：收<br/>傻子说：有点长<br/>那人说：没事先领我看看<br/>傻子说：等晚上吧……<p>到了夜里傻子把收废品的领到了铁路上，指着地上的火车轨道说：就是这两根，乌鲁木齐到上海的，你开个价吧。<br/>收废品的：滚你妈的!",
        "image": ""
      }
    ]
  },
  {
    "id": 60,
    "date": "2015/10/21",
    "title": "二货家里着火了",
    "itemList": [
      {
        "text": "一个二货，家里着火了。 <br/>二货报警说：119吗，我家发生火灾了。<br/>119：在哪里？<br/>二货：在我家。<br/>119：具体点。<br/>二货：在我家的厨房里。<br/>119：我说你现在的位置。<br/>二货：我他妈的趴在桌子底下。<br/>119：我们怎样才能到你家？<br/>二货：你们不他妈的有消防车吗？",
        "image": ""
      }
    ]
  },
  {
    "id": 70,
    "date": "2015/10/28",
    "title": "去丽江",
    "itemList": [
      {
        "text": "老总打电话给秘书，这几天去丽江玩玩你准备一下。<br/>秘书打给老公：这几天我要和老总去丽江开会。<br/>老公打给情人：这几天老婆不在家，陪我。<br/>情人打电话给辅导学生：这几天老师有事，停课。<br/>学生打电话给爷爷：这几天不上课，爷爷你陪我玩。",
        "image": "",
        "text": "爷爷给秘书打电话：丽江去不了了，孙子要我陪。<br/>秘书给老公打电话：老总突然有事不去丽江开会了。<br/>老公给情人打电话：老婆不走了下次再说。<br/>情人给辅导学生打电话：这几天照常上课。<br/>学生给爷爷打电话：老师说这几天照常上课。<br/>爷爷给秘书打电话：还是去丽江吧，你准备准备！",
        "image": ""
      }
    ]
  },
  {
    "id": 80,
    "date": "2017/3/18",
    "title": "不创新都得死",
    "itemList": [
      {
        "text": "一公司老总晚上酒驾，遇交警查车，弃车撒腿就跑，交警没追上。老总边跑边给老婆打电话，叫她马上报警，说家里的车被盗。</p><p>第二天，老总带着锦旗去交警队取车，握着交警同志的手说：神探啊，破案神速！交警：这都是我们应该做的，昨晚偷你车那小子跑太快，我们以为是酒驾，没想到是偷车的。</p><p>第三天，老总再次酒驾，发现前方不远在查车，心想不能故技重演，于是下车锁门，坐在马路边抽烟。警察赶到：你喝酒了？老总：是呀！警察：喝了还开车？老总：我没开，司机开的；警察兜一圈不见司机：人呢？老总摇头：这混蛋跑了。<br/>见警察诧异，老总接着说：他一看到你们查车，气不打一处来，骂道：警察半夜三更不在家陪老婆孩子父母，又TM出来折腾了。我一听就狠训他，他不服，我趁着酒劲打了他一巴掌，没想到这混蛋把车一扔跑了，你说气人不气人！警察激动万分：这小子该揍，谢谢哥理解！没事哥，你上车，我送你回家。老总坐在副驾，望着交警默默感悟：这年头不创新只有死路一条！</p><p>第四天，老总等四人都喝酒了……开到桥头，遇到查酒驾，四人傻眼了。老总让全车人下车，都在后面推车，推到警察跟前。警察问：咋滴啦？四人回答说：喝酒了，不能开车，家近，推回家去。警察一看后面的车一直堵，就问：谁喝的最少。老总说：我只喝了一瓶啤酒。警察说：一瓶啤酒没事，赶紧开走，别阻碍交通！</p><p>思路决定出路！太有才了。",
        "image": ""
      }
    ]
  },
  {
    "id": 85,
    "date": "2017/3/18",
    "title": "喝酒的最高境界",
    "itemList": [
      {
        "text": "两酒鬼喝得兴高采烈，一个问另一个：你是哪的人？<br/>答：四川的。哇！我也是四川的，老乡，干一杯。<br/>又问：你是四川哪里的？<br/>答：成都的。哇，我也是成都的，再干一杯。再问：你是成都哪里的？<br/>答：双流的。哇！我也是双流的，再干一杯，然后接着问:你姓啥？答:我姓罗。哇！我也是，<br/>这时，酒家老板实在看不下去了，打电话：老罗，你两个儿子又喝多了。",
        "image": ""
      }
    ]
  },
  {
    "id": 90,
    "date": "2015/12/16",
    "title": "全世界帝国主义联合起来",
    "itemList": [
      {
        "text": "想当年英美法总想着祸水东流让元首和毛熊干起来，后来想着利用末莉花革命把矛头引向亲俄亲伊朗的叙利亚。结果嘛，人算不如天算。真乱起来谁也别想独善其身，现在是几大流氓坐下来好好谈一谈的时候了，全世界帝国主义联合起来!",
        "image": "../assets/image/chinese/joke/1.jpg"
      }
    ]
  },
  {
    "id": 100,
    "date": "2015/12/16",
    "title": "小学语文",
    "itemList": [
      {
        "text": "现在小学语文太难了，看他们的一道作业题： <p>要求：把以下四句话用关联词连接：<br/>（1）李姐姐瘫痪了；<br/>（2）李姐姐顽强地学习；<br/>（3）李姐姐学会了多门外语；<br/>（4）李姐姐学会了针灸。<p>（正确答案应该是：李姐姐虽然瘫痪了，但顽强地学习，不仅学会了多门外语，而且还学会了针灸。）<p>结果有一个孩子写：虽然李姐姐顽强地学会了针灸和多门外语，可她还是瘫痪了。<p>后来，发现更猛的孩子写道：<br/>李姐姐不但学会了外语，还会了针灸，她那么顽强地学习，终于瘫痪了。<br/>李姐姐之所以瘫痪了，是因为顽强地学习，非但学会了多门外语，甚至学会了针灸。<br/>李姐姐是那么顽强的学习，不但学会了多门外语和针灸，最后还学会了瘫痪。<br/>李姐姐学会了多门外语，学会了针灸，又在顽强地学习瘫痪。<p>亮点总在最后：<br/>李姐姐通过顽强的学习，学会了多门外语和针灸，结果照着一本外文版针灸书把自己扎瘫痪了!",
        "image": ""
      }
    ]
  },
  {
    "id": 105,
    "date": "2017/07/10",
    "title": "季付还是月付",
    "itemList": [
      {
        "text": "<p>一老头给儿子买房子，去现场办理分期付款手续登记。银行业务员说：'先生您是季付，还是月付'。老头一听火了，说：'我他妈的不是继父，也不是岳父，我是……父亲'！</p>于是业务员就在申请表格上打钩了……一次付清。<p>人与人之间的误会往往在于你以为听懂了。",
        "image": ""
      }
    ]
  },
  {
    "id": 150,
    "date": "2016/06/25",
    "title": "空调车两块",
    "itemList": [
      {
        "text": "大妈上了空调车投了一块钱。<br/>司机说：“空调车两块！”。<br/>大妈答：“是凉快”。<br/>司机又说：“投两块”!<br/>大妈笑说：“不光头凉快，浑身都凉快”，说完往后头走。<br/>司机说:“我告诉你钱投两块”。<br/>大妈说:“我觉得后头人少更凉快”。<br/>司机无语，一车人笑倒了……",
        "image": ""
      }
    ]
  },
  {
    "id": 250,
    "date": "2017/3/15",
    "title": "成功的男人背后",
    "itemList": [
      {
        "text": "<p>一群游客在巴士上看老虎，一大款说，谁敢下车跑一圈还能活着上来，我给他一百万，话音刚落，一人扑通跳下车，拼命跑了一圈，被老虎追得喘不上气，好不容易才爬上车，大家忙着向他道喜，祝贺他获得一百万元。</p><p>但只见这人怒火冲冲地问：是谁刚才把我推下车的？</p><p>回头一望，只见他的老婆在笑，'你回来了，我就收钱，你回不来，我就换人…' </p><p>每个成功的男人背后，都有一个优秀的女人， 关键时刻，能推就推你一把 ！",
        "image": ""
      }
    ]
  },
  {
    "id": 260,
    "date": "2017/5/4",
    "title": "来一瓶82年的拉菲",
    "itemList": [
      {
        "text": "去饭馆用餐，坐下后问服务员，你们这里WIFI密码是多少？<br/>服务员回答，LYP82NDLF<br>我默念一遍，记不住，就跟服务员说，你这个密码太复杂了。<br/>服务员说，不复杂啊，来一瓶82年的拉菲，拼音首字母就是了。<br/>我一边念'来一瓶82年的拉菲', 一边输入密码。<br/>刚输完, 服务员问: 能打开吗? <br/>我说 '能'。 <br/>只听'砰'的一声, 服务员笑着说: '这是您要的82年的拉菲，三万六！'。<p>这个故事告诉我们: 吃饭的时候就好好吃饭, 别老捅咕那手机。</p>",
        "image": ""
      }
    ]
  },
  {
    "id": 300,
    "date": "2017/5/6",
    "title": "天黑了根本没太阳",
    "itemList": [
      {
        "text": "在当下朝核危机的敏感时刻，金正恩将军于今天举行了朝外记者招待会。<br/>金正恩在记者招待会上宣布：'朝鲜不仅要拥有原子弹、氢弹，而且我们要在10年内让朝鲜的宇航员登陆太阳！'<br/>众哗然。<br/>一位美国记者问道：'太阳温度那么高，你们怎么登上去呢？'<br/>顿时全场鸦雀无声。大家不知道该怎样回答这个问题。 <br/>这时金将军抽了一口烟缓缓说道：'我们天黑了去！'<br/>顿时全场朝鲜人响起雷鸣般的掌声……</p><p>正在白宫看电视直播的Trump冷笑着对周围的同僚说：'这二货，天黑了根本没太阳！ '<br/><br/>白宫内也响起了雷鸣般的掌声 ！",
        "image": ""
      }
    ]
  },
  {
    "id": 350,
    "date": "2017/2/21",
    "title": "笑得不能自理的神回复",
    "itemList": [
      {
        "text": "历史老师：你为什么交白卷？ <br/>我怕我会篡改历史 ",
        "image": ""
      },
      {
        "text": "你怎么一个人逛街啊？<br/> 半个人逛街我怕吓着你！",
        "image": ""
      },
      {
        "text": "我问电风扇我丑么？然后电风扇摇了一夜的头，顿时感觉好多了。 <br/>别听电风扇的，它都是吹的。",
        "image": ""
      },
      {
        "text": "都是一个老师教的，你看看别人怎么就考得那么好？<br/>因为不是一个父母生的。 ",
        "image": ""
      },
      {
        "text": "别人说吃大豆屁多，我吃大豆怎么光打嗝？ <br/>屁迷路了。 ",
        "i5": ""
      },
      {
        "text": "一整个披萨你要切8块还是12块？ <br/>8块吧，12块我吃不下。 ",
        "image": ""
      }
    ]
  },
  {
    "id": 360,
    "date": "2018/3/18",
    "title": "大爷取钱",
    "itemList": [
      {
        "text": "有位大爷去人民银行取钱，直接走到窗口，保安过来说： '大爷，按号。' <br/>大爷： '啥？' <br/>保安：'按号。' <br/>大爷心想，不愧是大银行呀，取个钱还要暗号，于是低声对保安说： '天王盖地虎。' <br/>保安无奈的帮老爷子按出一张排队票，老爷子心想： 吓死我了，居然被我蒙对了。 ",
        "image": ""
      }
    ]
  }
]