[
  {
    "id": 10,
    "date": "2017/2/21",
    "title": "高人就是能把複雜問題簡單化",
    "itemList": [
      {
        "text": "<p>高人就是能把複雜的問題簡單化，一語道破天機的人。</p><p>延安時期毛主席測問胡耀邦什麼叫軍事？胡回答了書本上解釋的很多東西。主席說：「沒那麼複雜，軍事就是打得贏就打，打不贏就跑。」<br/><br/>主席又問：「什麼叫政治？」胡耀邦又洋洋灑灑說古論今。主席笑著說：「沒這麼複雜，所謂政治就是讓對手下來，咱們上去！」<br/><br/>主席又問：「什麼是宣傳？」胡又引經據典滔滔不絕。主席不屑一顧地說：「沒那麼複雜！所謂宣傳就是要讓大家都認為咱們好，別人不好。」<br/><br/>主席又問：「什麼是愛情？」胡又引經據典滔滔不絕。主席笑了笑說：「沒那麼複雜！所謂愛情就是想一起睡覺。」",
        "image": ""
      }
    ]
  },
  {
    "id": 15,
    "date": "2017/7/18",
    "title": "会",
    "itemList": [
      {
        "text": "上午交流会，你忽悠我，我忽悠你；<br/>中午迎宾会，你灌醉我，我灌醉你；<br/>下午表彰会，你吹捧我，我吹捧你；<br/>晚上联欢会，你搂着我，我搂着你……</p><p>人多的会议不重要，重要的会议人不多；<br/>研究小事开大会，研究大事开小会；<br/>开会的人基本不干事，干事的人基本不开会。",
        "image": ""
      }
    ]
  },
  {
    "id": 20,
    "date": "2017/2/21",
    "title": "有本事限性别",
    "itemList": [
      {
        "text": "限号限行多没劲，有本事限性别，一三五男的出门，二四六女的上街，周日不限，每天13亿人出来6亿，窝着6亿，车也不堵了，天也蓝了，老婆出门老公放心了，老公出门老婆放心了，就连流氓都没目标了！也不用下岗了，厕所也不用中间垒墙了!",
        "image": ""
      }
    ]
  },
  {
    "id": 30,
    "date": "2017/3/5",
    "title": "P2P",
    "itemList": [
      {
        "text": "放高利贷改叫P2P，乞讨改叫众筹，统计改叫大数据分析，忽悠改叫互联网思维，办公室出租叫孵化器，圈地盖楼改叫科技园区，看场子收保护费叫平台战略，搅局叫颠覆式创新，借钱给靠谱朋友叫天使投资，借钱给不靠谱朋友叫风险投资，走街串巷叫O2O。你要他利，他要你的本，诈骗很简单。",
        "image": ""
      }
    ]
  },
  {
    "id": 40,
    "date": "2017/3/5",
    "title": "什么叫融资",
    "itemList": [
      {
        "text": "什么叫融资。请5个人，一起吃火锅。给第1个电话：“顺路买点蔬菜，就差菜了。”给第2个电话：“顺路买点羊肉，就差肉了。”给第3个电话：“顺路买点冻豆腐鱼丸啥的，就差这个了。”给第4个电话：“就差酒了。”给第5个电话：“就差点火锅底料了！”然后，挂电话烧水，坐等……什么叫资金链断裂？就是其中任何一人放了鸽子。",
        "image": ""
      }
    ]
  },
  {
    "id": 50,
    "date": "2017/3/5",
    "title": "先免费、后收费",
    "itemList": [
      {
        "text": "一姑娘离开夜场进了一公司。一个月内和20位已婚男同事发生关系，然后辞职。几天后，她给20位男同事发了一条同样的微信：怀孕了，需要5000元做人流。一周后，收到10万元——这就是互联网“先免费、后收费”的营销思维；然后，各种隐私数据，也成了一种资源。这叫大数据营销，属顶级互联网思维。",
        "image": ""
      }
    ]
  },
  {
    "id": 55,
    "date": "2017/3/12",
    "title": "老外考漢語",
    "itemList": [
      {
        "text": "某老外苦學漢語十年，到中國參加漢語考試，遇到了悲慘的考試題目。</p><p>請解釋下文中每個「意思」的意思</p><p>阿呆給領導送紅包時，兩人的對話頗有意思。</p><p>領導：「你這是什麼意思？」<br/>阿呆：「沒什麼意思，意思意思。」<br/>領導：「你這就不夠意思了。」<br/>阿呆：「小意思，小意思。」<br/>領導：「你這人真有意思。」 <br/>阿呆：「其實也沒有別的意思。」 <br/>領導：「那我就不好意思了。」 <br/>阿呆：「是我不好意思。」 </p><p>老外淚流滿面，交白卷回國。",
        "image": ""
      }
    ]
  },
  {
    "id": 60,
    "date": "2017/3/15",
    "title": "“乳”的含义",
    "itemList": [
      {
        "text": "<p>一位老师向老外学生解释“乳” 字的含意：乳即是小的意思，比如乳鸽、乳猪等。</p><p>讲解完，老师要求老外学生用“乳”字造句。</p><p>老外学生造句说：“现在房价太高了，所以我家只能买得起20平方米的乳房。”<br/>老师听了，冒着冷汗说：“再造一个！”<br/>老外学生：“我年纪太小，连一米宽的乳沟都跳不过去。”<br/>老师冷汗如雨下，说：“再造一个！”<br/>老外学生说：“老师我真的想不出来了，我的乳头都快想破了！”",
        "image": ""
      }
    ]
  },
  {
    "id": 65,
    "date": "2015/12/20",
    "title": "思路一变天地宽",
    "itemList": [
      {
        "text": "北京某官员和山西老板吃饭 ，酒后豪言：“给老子一百万，在北京没有办不成的事”。 <br/><br/>煤老板听后小声说：“哥，给你一个亿，能不能把天安门城楼上那张照片换成我爹的？”<br/>官员道：“行，一周后保证办成＂。<br/>一周后，煤老板进京仍见天安门上是毛主席照片，遂找官员理论退钱。<br/>官员称任务完成不能退。<br/>煤老板怒称天安门上是老毛照片不是他爹。<br/>官员答：“就是你爸，回去查户口就知”。 <br/>煤老板无奈回家乡查户口，见自己名字已经被改成”毛岸英”。</p><p>同学们啊，思路一变天地宽 。<br/>总结：改变不了大局,可以改变自己！",
        "image": ""
      }
    ]
  },
  {
    "id": 67,
    "date": "2017/3/28",
    "title": "退休症",
    "itemList": [
      {
        "text": "一市长退休后，有失落感。遂把新装修的房间逐一命名，客厅为“广电局”，过道为“交通局”，书房为“文化局”，厕所为“卫生局”，厨房为“食品药品监管局”，主卧为“人口与计划生育局”，老人房间为“社保局”，小孩房间为“教育局”，保姆房间为“劳动局”，门口狗窝挂牌：“公安局”，大门口挂一牌子：“市人民政府”，最后总觉得还少点啥？！考虑许久，走到院子里的鸡窝，挂牌为：夜总会",
        "image": ""
      }
    ]
  },
  {
    "id": 70,
    "date": "2017/3/20",
    "title": "太精辟了",
    "itemList": [
      {
        "text": "一个的士司机说：'如果找十几个20岁左右的死刑犯，让他们练四年足球，然后他们踢世界杯 ，出线了就出狱，出不了拉回来枪毙，中国足球一准儿出线！'</p><p>我惊异于他的想法，问道：'那么解决现在离婚越来越厉害的现象呢?' 司机掐断烟头狠心的说道：'真正能阻止离婚的婚姻法是,离婚后房子归国家！'</p><p>我问：'现在情人节和清明节的区别是？'</p><p>司机想了想说：'情人节和清明节是一样的，都是送花送吃的。区别在于：情人节烧真钱，说一堆鬼话给人听，清明节烧假钱，说一堆人话给鬼听' 说的砸这么对呢, 这段话太精辟了…",
        "image": ""
      }
    ]
  },
  {
    "id": 75,
    "date": "2017/3/29",
    "title": "这肯定是中国的专家",
    "itemList": [
      {
        "text": "学生： 老师，昨晚我见一盲人打着灯笼走路。 他明明看不见，打灯笼有何用？</p><p>老师： 如果他是怕别人看不清路，这是儒家；<br/>如果他是怕别人撞到他，这是墨家；<br/>如果他认为黑夜出门就必须打灯笼，这是法家；<br/>如果他认为想打就打顺其自然，这是道家；<br/>如果他借此开示众生，这是佛家；<br/>如果他明明看得见却装瞎，这是中国的政治家；<br/>如果他是真瞎，却打着灯笼给人引路，这肯定是中国的专家！",
        "image": ""
      }
    ]
  },
  {
    "id": 80,
    "date": "2017/3/20",
    "title": "啥叫名牌",
    "itemList": [
      {
        "text": "啥叫名牌？ 成本价后面加一个0的，就叫名牌。 <br/>成本价后面加两个0的，就叫奢侈品。 <br/>成本价后面随便想加几个0就加几个0的，就叫文物！",
        "image": ""
      }
    ]
  },
  {
    "id": 85,
    "date": "2017/6/18",
    "title": "儿子想参军保卫祖国",
    "itemList": [
      {
        "text": "<p>儿子从小就想参军，终于有机会了就走到父亲跟前说： '我要参军保卫国家，如果美帝国主义真敢入侵……'</p><p>'啪'，父亲一个耳光扇过来。 '家人都保不了，还保卫国家？你说说美国人能抢你啥？国家啥东西需要你保卫？'</p><p>子：'我要保卫咱的土地……'</p><p>父：'嘿嘿，你先说说你哪来的土地？连几十平方米的小房子都买不起，就算买得起也只有70年暂时的使用权，还土地？等你有了土地再去保卫吧！'</p><p>子： '美国想吞并我们…'</p><p>父：'你不是天天想出国吗？你同学不也是一大堆想出国吗？吞并了把出国费也省了。 '</p><p>子：'被美国吞并了都白人说了算，中国人都成二等公民了。'</p><p>父： '美国选总统都是一人一票，要合并了咱中国，13亿华人对他2亿白人，谁说了算？'</p><p>子： '美国人打过来，会颠覆我们的人民政府，我要保卫人民政府！'</p><p>父： '啪'（又是一记耳光），你究竟想保卫谁？国税局？财政部？发改委？证监委？卫生部？药监局？房管局？规划局？计生办？城管？还是足协？你如果想保卫这帮混蛋，看老子不打断你的腿……</p><p>（儿子赌气地） '我想通了，如果美国入侵，我去给美国大兵开门带路！'</p><p>父：'啪（又是一记耳光），还能轮到你？领导早排队带路了，现在你就赶紧好好学习，将来当领导。'",
        "image": ""
      }
    ]
  },
  {
    "id": 100,
    "date": "2016/1/26",
    "title": "可爱的汉字",
    "itemList": [
      {
        "text": "<p>「晶」对「品」说：「你们家都没有装修喔？」</p><p>「夫」对「天」说：「我总算盼到了出头之日！」</p><p>「熊」对「能」说：「怎麼穷成这样啦？四个熊掌全卖了！」</p><p>「丙」对「两」说：「你家什麼时候多了一个人，结婚了？」</p><p>「乒」对「乓」说：「你我都一样，一等残废军人。」</p><p>「兵」对「丘」说：「兄弟，踩上地雷了吧，两腿炸得都没了？」</p><p>「王」对「皇」说：「当皇上有什麽好处？你看，头发都白了！」</p><p>「口」对「回」说：「亲爱的，都怀孕这麽久了，也不说一声！」</p><p>「也」对「她」说：「当老板罗？出门还带秘书！」</p><p>「日」对「旦」说：「你什麼时候学会玩滑板了？」</p><p>「果」对「裸」说：「哥们儿，你穿上衣服还不如不穿！」</p><p>「由」对「甲」说：「你什麼时候学会倒立了？」",
        "image": ""
      }
    ]
  },
  {
    "id": 110,
    "date": "2017/5/27",
    "title": "老王最后死了没有",
    "itemList": [
      {
        "text": "<p>隔壁老王在班级三十年的同学聚会上，发现自己曾经暗恋多年的女神居然对自己也暗恋多年，不由得感慨万千，会上相谈甚欢，一时冲动向女神发一微信：'滚床单不？'女神回信：'滚。'</p><p>老王虽然已经是国内著名大学的中文教授，竟然也不明白这个‘滚’字是什么意思！</p><p>他心有不甘，回家后失眠了几个晚上，终于鼓起勇气发一微信给女神：'去我的家还是去你的家？'</p><p>女神回复：'去你的。'</p><p>老王不解何意，几天后终于忍不住给女伸发微信：那来我家吧！</p><p>女神回：'我去。'</p><p>老王彻底懵了。</p><p>过了几天，女神没去，老王又忍不住，发信息问女神：我在家等着你？</p><p>女神回信：'你等着！'</p><p>又过了几天，老王没等到女神，实在又忍不住了，就给女神发信息：要不我到你家试试？</p><p>女神回答：'你来试试！'</p><p>老王彻底崩溃了，心里没底了，但还是不死心，就试探性的给女神发信息：你说我到底敢不敢到你家试试？</p><p>女神回答：'你敢！'</p><p>又过了几天是情人节，女神感觉到老王的困惑，为了表明自己的态度，回复：'我是个性开放的人，不是个性开放的人。'</p><p>老王最后孤注一掷，决定晚上趁送玫瑰花去女神家。按门铃女神开门，老王在门口怯生生地送上玫瑰时问道：'我可以进来么？'</p><p>女神答：'你进来我今晚就弄死你！'</p><p>请问有经验的各位微友，情人节晚上老王最后死了没有？",
        "image": ""
      }
    ]
  },
  {
    "id": 120,
    "date": "2017/7/27",
    "title": "非诚勿扰",
    "itemList": [
      {
        "text": "一英国小伙参加“非诚勿扰”节目：</p><p>一女首先发问:是独生子吗？<br/>答：不是独子，有个哥，刚结婚（数盏灯灭）</p><p>又有女问：有房吗?<br/>答:有房,不过是上世纪的老宅子（数盏灯灭）</p><p>又有女问:你爹在哪单位?<br/>答：我爸没工作（只剩一盏灯）</p><p>又有女问：婚后住哪？<br/>答：和奶奶、爸爸、后妈、哥哥、嫂子一起住（数盏灯灭）</p><p>又有女问:你干啥的？<br/>答:我是大兵（数盏灯灭）</p><p>最后的女孩问：结婚有宝马奔驰接吗?<br/>答:没……我奶奶肯定不同意，马车……行吗?</p><p>女孩嗤之以鼻，回:宁在宝马里哭,不在马车上笑!<br/>灯全灭......</p><p>次日，英《泰晤士报》头版头条新闻标题为：我皇室成员哈里王子参加中国电视征婚首轮即遭淘汰。",
        "image": ""
      }
    ]
  },
  {
    "id": 200,
    "date": "2015/10/24",
    "title": "小段子1",
    "itemList": [
      {
        "text": "*** 昨天看书才知道，喝酒会导致高血压，心脏病，尿毒症，酒精肝！..  吓出一身冷汗！..  赶紧喝了几杯酒压压惊并下定决心：以后再也不看书了，太吓人了……",
        "image": ""
      },
      {
        "text": "*** 一架飞机迫降海面上，空姐让乘客从滑梯下海去坐救生艇，乘客不敢。空姐求助机长。见多识广的机长说：“你要对美国人说这是冒险，对英国人说这是荣誉，对法国人说这是浪漫，对德国人说这是规定，对日本人说这是命令，一切问题就都搞定了。”空姐为难地说：“可是都是中国人啊！”机长笑了：“那就更好办了，你告诉他们这是免费的！”",
        "image": ""
      },
      {
        "text": "*** 现在骗子真多，刚刚又看到新闻上说储户存款消失，从几十万到几百万不等，我赶紧骑自行车到银行查看，卡里的8块钱还在，吓死俺了。以后再也不看新闻了，心好累。走出银行，心更累了，钱还在，自行车不见了！",
        "image": ""
      },
      {
        "text": "*** 一哥们醉酒驾驶，把一家三口刮倒，还好都是轻伤……警察赶到，处理现场，那哥们说：“警...察...同志，我就喝一瓶酒，真..不是...我...的问题，我...就没见过...大半夜的，一家三口在马路中间...吃火锅的...”警察：别BB了！赶紧把车从人家屋里倒出去！",
        "image": ""
      },
      {
        "text": "*** 孩子正考虑有关'遗传与环境'的问题。母亲插话道：这个问题很简单嘛，大家都知道如果孩子像父亲，那就是遗传；像邻居，那就是环境。",
        "image": ""
      },
      {
        "text": "*** 卖瓜小贩：'快来吃西瓜，不甜不要钱！' 饥渴的路人：'哇！太好了，老板，来个不甜的。'",
        "image": ""
      },
      {
        "text": "*** 男人这种生物到底有没有情商啊！！！前几天我在家做菜，不小心切到手，想让男友心疼心疼就给他发了信息：'亲爱的，刚才做菜的时候不小心切到手了......'。 结果，男友给我回了信息：'啊！！！你会做菜，做的啥菜？'",
        "image": ""
      },
      {
        "text": "*** 幼稚与成熟<br/>所谓幼稚，就是既憋不住尿，又憋不住话与情绪；<br/>所谓不够成熟，就是只能憋得住尿，却憋不住话与情绪；<br/>所谓成熟，就是既憋得住尿，又憋得住话与情绪；<br/>所谓衰老，就是憋得住话与情绪，却憋不住尿了。",
        "image": ""
      },
      {
        "text": "*** 你是那个杀猪的<br/>小光是一位勤奋好学的学生，他利用寒假兼职赚取学费。 白天帮肉贩割肉，晚上则到医院实习。某晚，有位老妇因急诊，要施行手术，由小光推她进手术室。老妇惊慌失色地狂喊： '天啊！你是那个杀猪的，你要把我推到哪啊！'",
        "image": ""
      },
      {
        "text": "*** 昨天去广场散步，看到有个老头拿着海绵笔在地上写大字，忍不住凑上去看。老头看我一眼，提笔写了个“滚”字。我心想，就看一下至于吗？忍住心头怒气继续看。老头又看我一眼，又写了个“滚”。我再也忍不住了，上去一脚将老头踢倒在地……警察来了问咋回事，老头委屈的说“我就想写句 滚滚长江东逝水，刚写两个字，就被这个神经病踹倒了”。<br/>开悟：凡事一定要看全面",
        "image": ""
      },
      {
        "text": "*** 一个不太熟的人，结婚两年了还来发喜帖。我也是醉了。听我妈讲，我出生没办满月酒的，要不要发个请帖给他呢？",
        "image": ""
      }
    ]
  },
  {
    "id": 205,
    "date": "2015/11/14",
    "title": "小段子2",
    "itemList": [
      {
        "text": "*** 下午肚子饿，看见同事桌上有瓶酸奶，想都没想就喝了，一会同事来了大叫到：“我的洗面奶怎么不见了！108块啊！”哥没说话，只是默默的走向厕所，一顿抠嗓子，老难受了，把东西拼命的吐，直到吐出酸水，好不容易吐的差不多了，眼泪叭嚓滴回到座位上时，同事抱着一个瓶子 说：“吓死我了，洗面奶滚到桌子下了，我的酸奶怎么又不见了呢。”哥心里直骂：你奶奶个熊滴，喝你点酸奶，把人往死里整。",
        "image": ""
      },
      {
        "text": "*** 朋友说他的媳妇特别懒，我问咋了，他说他家住三楼，他媳妇每次在网上买东西的时候都在备注上写：“孕妇，行动不便，请送货上门！”今天，送快递的小哥终于忍不住了，在楼下大喊：“都三年了！你怀的是哪吒么？ ”",
        "image": ""
      },
      {
        "text": "*** 一个兄弟买了眼药水，回家后点了两滴，闭上眼睛转了转眼珠，睁开眼，一片漆黑，突然什么都看不到了。 尼玛，这是买了什么眼药水？两滴致瞎！顿时从椅子上摔倒了，桌子也踢翻了，嚎啕大哭。 这时，他老婆在一旁骂道：“越来越神经了，停个电都把你吓成这样！”",
        "image": ""
      },
      {
        "text": "*** 我佩服过三个男人，一是许仙，二是董永，三是宁采臣。 一个敢睡蛇，一个敢睡仙，最后一个连鬼也不放过。 直到看了花千骨，我才知道，落十一才是真汉子，敢睡毛毛虫。 最看不起的就是孙悟空，傻B，把七个仙女定住，他居然跑去偷桃子了、 但是不得不佩服孙悟空他爹、居然能把石头整怀孕、我也是醉了。",
        "image": ""
      },
      {
        "text": "*** 有两个人大吵一天，一人说3x8=24，一人说3x8=21。相争不下告到县衙。县官听罢说，把三八二十四的拖出去打二十板！”二十四的不满：“明明是他蠢，如何打我？”县官答：“跟三八二十一的人能吵一天，还说你不蠢？不打你打谁？”",
        "image": ""
      },
      {
        "text": "*** 某官员上任，为示亲民，与下属寒暄，说： “我是农民的儿子。” 然后问秘书：“你呢？” 秘书是官二代，谄媚道：“我是农民的孙子。” 领导很满意，再问身边刚分配进来的一名大学生： “你呢？” 这个大学生憨厚地答道： “俺就是农民。”",
        "image": ""
      },
      {
        "text": "*** 夜里老婆听见老公在哭，忙把老公叫醒，问他怎么了？ 老公说：“ 梦见又结婚了!” <br/>老婆说：“ 那不是挺好的吗？ 哭啥呀，应该高兴才对!” <br/>老公说：“ 入洞房的时候一揭盖头， 还是你...”",
        "image": ""
      },
      {
        "text": "*** 一哥们特抠门，家里什么东西都舍不得扔。一天我去他家，他正在洗冷水澡。 <br/>我说：“哥，你咋了？这么冷的天，家里又不是没有暖气，你怎么洗冷水澡啊”？<br/>他说了句让我终身难忘的话：“家里还剩两包感冒药，再不吃就过期了”！",
        "image": ""
      },
      {
        "text": "*** 刚才接一骗子电话:我们是某某银行，刚才查询发现您的银行卡昨天在境外消费180万8千美元，请问是您本人消费么？<br/>我说:是我本人消费的。<br/>骗子沉默了5秒后说: 您真能吹牛逼... ...把我思路都打乱了... ...",
        "image": ""
      },
      {
        "text": "*** 刚刚在电梯间看见一小孩儿在吃雪糕，出于关心，顺口告诉他：“这么凉的天，会吃坏身体的！”。  <br/>小孩告诉我，他的奶奶活了103岁。<br/>我问：'吃雪糕吃的？'<br/>他说：'不是，我奶奶从来不管闲事！'<br/>多么深刻！现在终于知道为什么衰老得快了！",
        "image": ""
      }
    ]
  },
  {
    "id": 210,
    "date": "2015/12/28",
    "title": "小段子3",
    "itemList": [
      {
        "text": "*** 在曹操墓发现一具小孩尸骨，砖家说是小时候的曹操。",
        "image": ""
      },
      {
        "text": "*** 巴士司机负责将20名精神病患送到病院，他中途偷懒停车到酒吧喝酒，等喝完酒后巴士上的精神病患全逃跑了。司机想了个歪念——把车开到了附近公交车站，招呼说可以免费搭乘。 然后他把这些乘客送进了精神病院，并告诉医院人员这些病人非常容易激动，胡言乱语、充满幻觉……三天后医院才证实这些人是正常人！",
        "image": ""
      },
      {
        "text": "*** 英国马拉松仅一人完成比赛，第二名带着五千人跑错路。",
        "image": ""
      },
      {
        "text": "*** 一张姓男子偷窃仓库价值5万饮料，连夜将瓶中饮料倒掉，将空水瓶卖了200多块……。",
        "image": ""
      },
      {
        "text": "*** 印度怀疑中国用无人机监视印度，研究了半年发现那只是火星。",
        "image": ""
      },
      {
        "text": "*** 一男子在树下休息 因鼾声太像野猪被猎人射杀。",
        "image": ""
      },
      {
        "text": "*** 蜘蛛要和蜜蜂结婚了。 蜘蛛问他妈妈： “为什么要我和蜜蜂结婚？” 蜘蛛妈妈说： “蜜蜂是唠叨了点，可人家好歹是个空姐。” 蜘蛛说： “我比较喜欢蚊子小姐。” 蜘蛛妈妈说： “别提那个小护士了，上次妈生病打针，她把妈打个水肿。”</p><p>蜜蜂问她妈妈： “为什么要我和蜘蛛结婚？” 蜜蜂妈妈说： “蜘蛛丑是丑了点，可人家好歹是搞网络的。” 蜜蜂说： “蚂蚁大哥不错呀！ ”。 蜜蜂妈妈说： “别提那小工头，整天扛着东西东奔西跑的，连部货车也没有。” 蜜蜂说： “人家喜欢隔壁的苍蝇大哥嘛。”蜜蜂妈妈说： “苍蝇帅是帅了点，可你也不能嫁给个挑粪的呀！ ”",
        "image": ""
      },
      {
        "text": "*** 一个姑娘上了高铁，见自己的座位上坐着一男士。 她核对自己的票，客气地说：“先生，您坐错位置了吧？” 男士拿出票嚷嚷着：“看清楚点，这是我的座，你瞎了？” 女孩仔细看了他的票，不再做声，默默的站在他的身旁。一会儿高铁起程了，女孩低头轻松对男士说：“先生，您没坐错位，您坐错车了！” </p><p>有一种忍让，叫做让你后悔都来不及，如果嚎叫能解决问题，驴早就统治了世界！",
        "image": ""
      },
      {
        "text": "*** 西安高温42℃，钟楼一老人不慎被车刮倒，老人二话没说立马爬了起来，一点都没有碰瓷赔钱的意思，围观众人议论纷纷：'大爷人不错'，'大爷素质真高'，'大爷身体棒啊！', '大爷是西安人的骄傲！'</p><p>老人说：你躺一下试试！烫得要死！ 再不起来就直接火化了。",
        "image": ""
      }
    ]
  },
  {
    "id": 220,
    "date": "2015/12/28",
    "title": "小段子4",
    "itemList": [
      {
        "text": "*** JAMES ELLIOT——加州长滩市的抢劫犯，他用.38口径左轮枪对准被害人开枪时，卡弹了! 然后他把枪口对准自己眼睛仔细瞄了一眼，同时扣下了扳机，这次枪没有卡弹。",
        "image": ""
      },
      {
        "text": "*** 美国一青年举枪自杀，被其母亲发现后报警，警察为防止该青年自杀，将其击毙。",
        "image": ""
      },
      {
        "text": "*** 阿肯色州一个小伙子想喝啤酒，他朝酒铺橱窗扔了空心砖打算砸破玻璃抢几瓶酒，橱窗是强化玻璃，空心砖反弹回来把他砸昏，整个过程被录像下来。结果这家伙把商店告上了法庭。",
        "image": ""
      },
      {
        "text": "*** 易斯安纳有个男人到一个便利商店，拿出20元纸钞要求找零；当职员打开收款机时他亮出手枪要求职员把收款机现金都给他。 店员照做了，他一共拿走15元后迅速消失，但把自己的20元钞票留在柜台上。 这事引起一个法律问题——人拿枪威胁要给你钱算不算犯罪？",
        "image": ""
      },
      {
        "text": "*** 美国有个男人在暴风雪中铲雪一小时，清出一个停车位。 当他把车开过去时，一位女士抢先占了车位，他拔枪一枪把她干掉了。",
        "image": ""
      },
      {
        "text": "*** 瑞士酒店厨师被切肉机切断了一根手指，向保险公司要求赔偿，保险公司怀疑他是操作错误，派了理险代表来检查机器。 理险代表操作切肉机之后也失去了一根手指，保险公司终于核准了厨师的理赔要求。",
        "image": ""
      },
      {
        "text": "*** 昨天看书才知道，喝酒会导致高血压，心脏病，尿毒症，酒精肝！..  吓出一身冷汗！..  赶紧喝了几杯酒压压惊并下定决心： 以后再也不看书了，太吓人了……",
        "image": ""
      },
      {
        "text": "*** 四个老人家打麻将，一圈后一人去厕所，上完厕所后把打麻将这事 给忘了，直接回家了<br/>另外三人久等，见其未归，决定寻找。但谁也想不起刚才和他们在一 起打麻将是谁了。<br/>岁月无情，趁着年轻你记得我，我记得你，没事便齐齐到处转转，吃吃饭，喝点酒，免得时间长了，大家都忘了谁是谁。",
        "image": ""
      },
      {
        "text": "*** 古语说人生七十古来稀。现实是男人七十一枝花！请看：邓小平七十二上台，改变了中国；里根七十一当选，改变了苏联；杜特尔特七十当选，改变了菲律宾；特朗普七十上台，就要改变美国！孔子父亲七十讨了一个十七岁的老婆，生下了一个千古圣人。他奶奶的，这才发现男人们成功的机会是在七十后！各位老退人员，和上述他们比，你们还年轻，革命尚未成功，同志仍需努力！真是任重而道远啊！",
        "image": ""
      }
    ]
  },
  {
    "id": 230,
    "date": "2017/3/26",
    "title": "小明滚出去 ",
    "itemList": [
      {
        "text": "老师：你们怎么老是考不过隔壁班？<br/>小明：因为隔壁班不是你教的。<br/>老师：滚出去。",
        "image": ""
      },
      {
        "text": "老师：请同学们用“从小”造句。<br/>小明：我从小便的姿势可以判断是男生还是女生。<br/>老师：就你能，那你再用“小便”造个句子。<br/>小明：我一看老师胸部的大小便知道您是什么罩杯。<br/>老师：你给我滚出去。",
        "image": ""
      },
      {
        "text": "小明： 如果一个东西是我主动给别人的，那么给多少我都不心疼。可如果对方硬管我要，我就会很反感，宁可扔了也不想给了。<br/>老师： 这TM就是你不交作业的理由。 滚出去！",
        "image": ""
      },
      {
        "text": "小明： 我对这个世界非常厌倦，我只是想一个人趴桌子上静一静。用佛家的话来说，我这叫冥想。道家的话来说这叫入定。 <br/>老师： 上课睡觉你也能说的这么清新脱俗，滚出去。",
        "image": ""
      },
      {
        "text": "老师问小明：喜欢小动物么?<br/>小明：当然喜欢<br/>老师:喜欢到什么程度呢?<br/>小明：这怎么说呢，，，顿顿都有吧。<br/>老师: 滚出去。 ",
        "image": ""
      },
      {
        "text": "老师： 一分耕耘一分收获。 <br/>小明说： 种下去是一分，拿出来也是一分，为什么还要耕耘？ <br/>老师： 滚出去。",
        "image": ""
      },
      {
        "text": "老师：请大家说说你们的愿望。 <br/>小明：去山东蓝翔学挖掘机。<br/>老师：给我个理由。 <br/>小明：刨你家祖坟。 <br/>老师：滚出去。",
        "image": ""
      },
      {
        "text": "小明：老师我喜欢你。 <br/>老师：我不喜欢小孩。 <br/>小明：我也不喜欢小孩，我们可以不要小孩。 <br/>老师：滚出去。",
        "image": ""
      },
      {
        "text": "小学时，正逢上自然课，老师讲到 “杠杆原理”，启发大家： 除了铁棍、木棍，还有什么可以做杠杆？<br/>小明： 还有光棍。 <br/>老师： 滚出去。",
        "image": ""
      },
      {
        "text": "生理课上，老师发问：什么时候女人们说的话最少？<br/>小明：二月份。<br/>老师：为什么。<br/>小明：因为二月份天数最少。<br/>老师：小明，老规矩。滚出去。",
        "image": ""
      },
      {
        "text": "新生入学军训时接受校长的检阅： 同学们好！<br/>新生们：校长好！<br/>校长：同学们辛苦了！同学们晒黑了！<br/>新生们顿时语塞，不知如何回答。<br/>沉默片刻后，小明大声回答：校长更黑！<br/>校长：你给我滚出来。",
        "image": ""
      },
      {
        "text": "老师: 同学们，你们觉得哪位古代人物最厉害？<br/>同学:楚霸王，关羽，郭靖，武松……<br/>老师:还有吗？<br/>小明:许仙<br/>老师:为什么？<br/>小明:因为蛇交配一次要12个小时，而许仙娶了白素贞还生下个儿子。<br/>老师:滚出去。",
        "image": ""
      },
      {
        "text": "老师：金钱与智慧，你们会选什么？<br/>小明：我当然是要金钱。<br/>老师：而我会选择智慧，你知道为什么吗？<br/>小明：当然，人们都会选择自己缺少的东西，我能理解！<br/>老师：滚。",
        "image": ""
      },
      {
        "text": "当别人已经不感兴趣，而他还是一个劲的讲下去的人，我们叫他什么？<br/>小明：老师。<br/>老师：滚。",
        "image": ""
      },
      {
        "text": "老师：蒸一个包子一分钟，蒸九个包子要多久？<br/>小明：九分钟？<br/>老师：你傻呀。 你们家蒸包子一个一个蒸呀？<br/>小明表示不服： 那我问你，吃一个馒头一分钟，吃十个馒头呢？<br/>老师：十分钟呀！你以为我想你一样傻呀！<br/>小明：十分钟吃十个馒头！撑死你个饭桶！<br/>老师：...滚出去。",
        "image": ""
      }
    ]
  }
]