[
  {
    "id": 100,
    "date": "2019/10/29",
    "title": "JBoss AS/WildFly/JBossEAP",
    "itemList": [
      {
        "text": "<p><b>WildFly</b><br/>WildFly, formerly known as JBoss AS, or simply JBoss, is a free and open-source application server authored by JBoss, now developed by Red Hat. WildFly is written in Java and implements the Java Platform, Enterprise Edition (Java EE) specification. It runs on multiple platforms.</p>",
        "image": ""
      },
      {
        "text": "<p><b>JBoss EAP</b><br/>JBoss Enterprise Application platform is a subscription based, Red Hat's supported application server. JBoss EAP is still an opensource project but if you want to use JBoss EAP in production with Red Hat's support, then you need to activate a subscription.</p>",
        "image": ""
      },
      {
        "text": "<p>In general terms, the following tables summarizes the version of WildFly used as baseline for a JBoss EAP version:</p>",
        "image": "../assets/image/it/tool/jboss.png"
      }
    ]
  },
  {
    "id": 300,
    "date": "2020/08/01",
    "title": "IBM Websphere Liberty",
    "itemList": [
      {
        "text": "<p>Liberty is a highly composable, fast to start, dynamic application server runtime environment. Because Liberty does not include a Java™ runtime environment (JRE), you must install a compliant Java implementation (JRE or SDK) beforehand.</p>",
        "image": ""
      },
      {
        "text": "<p>This server supports two models of application deployment:<ul><li>Deploy an application by dropping it into the dropins or apps directory.</li><li>Deploy an application by adding it to the server configuration file.</li></ul></p>",
        "image": ""
      },
      {
        "text": "<p>To install the admin feature from the command line, type: <code>bin/installUtility install adminCenter-1.0</code></p>",
        "image": ""
      },
      {
        "text": "<p>To use the feature at runtime add the following to your server.xml file: <code><feature>adminCenter-1.0</feature></code></p>",
        "image": ""
      },
      {
        "text": "<p>Then add the admin user to the administrator-role:<br><code>&lt;administrator-role&gt;</code><br><code>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;user>admin&lt;/user&gt;</code><br><code>&lt;/administrator-role&gt;</code><br></p>",
        "image": ""
      },
      {
        "text": "<p>To list the feature supported: <code>bin/productInfo featureInfo</code></p>",
        "image": ""
      },
      {
        "text": "<p>To see the version: <code>bin/productInfo version</code></p>",
        "image": ""
      },
      {
        "text": "<p><b>Environment Variables</b><ul><li>Specify environment variables by using server.env files.</li><li>The server management script searches for server.env files in two locations: ${wlp.install.dir}/etc/server.env and ${server.config.dir}/server.env. If both files are present, the contents of the two files are merged; values in the server-level file take precedence over values in the runtime-level file.</li><li>You can also specify these environment variables in the shell environment, but the server.env files take precedence over those variables.</li></ul></p>",
        "image": ""
      }
    ]
  }
]